src/main/resources/deleteUser-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://techprimers.com/spring-boot-soap-example">
    <soapenv:Header/>
    <soapenv:Body>
        <us:deleteUserWithRolesRequest>
            <us:login>q</us:login>
        </us:deleteUserWithRolesRequest>
    </soapenv:Body>
</soapenv:Envelope>